arrangement change for the structure in readme
